brew "argocd"
brew "btop"
brew "ruby"
brew "cocoapods"
brew "docker"
brew "docker-compose"
brew "fastfetch"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "helm"
brew "k9s"
brew "kompose"
brew "kubectx"
brew "kubernetes-cli"
brew "lazydocker"
brew "minikube"
brew "ncdu"
brew "neovim"
brew "pgloader"
brew "postgresql@14"
brew "starship"
brew "vim"
brew "wget"
brew "yazi"
cask "1password"
cask "1password-cli"
cask "db-browser-for-sqlite"
cask "discord"
cask "docker-desktop"
cask "element"
cask "font-cascadia-mono-nf"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "gcloud-cli"
cask "google-chrome"
cask "kitty"
cask "logi-options+"
cask "lunacy"
cask "minecraft"
cask "obsidian"
cask "pgadmin4"
cask "plex"
cask "protonvpn"
cask "signal"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zen"
vscode "1password.op-vscode"
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "ecmel.vscode-html-css"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "grafana.grafana-alloy"
vscode "grafana.grafana-vscode"
vscode "hashicorp.terraform"
vscode "hollowtree.vue-snippets"
vscode "jeff-hykin.better-cpp-syntax"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rooveterinaryinc.roo-cline"
vscode "ventura.prom"
vscode "vue.volar"
go "github.com/bootdotdev/bootdev"
go "golang.org/x/tools/gopls"
